{
  "users": [
    {
      "id": "admin",
      "password": "admin1234",
      "admin_access": true,
      "email": "admin@gmail.com",
      "fullname": "Адміністратор",
      "avatar": "./Images/Avatars/1.png"
    },
    {
      "id": "user",
      "password": "1234",
      "admin_access": false,
      "email": "user@gmail.com",
      "fullname": "Користувач",
      "avatar": "./Images/Avatars/5.png"
    }
  ],
  "locations": [
    {
      "id": "1",
      "name": "Ужгородський замок",
      "image": "https://tourinform.org.ua/wp-content/uploads/2017/12/big_1435.jpg",
      "users_liked": [
        "admin",
        "user"
      ],
      "ticket_price": 20,
      "ticket_prices": [
        {
          "for": "Дорослі",
          "amount": 50
        },
        {
          "for": "Студенти",
          "amount": 40
        },
        {
          "for": "Школярі",
          "amount": 20
        }
      ],
      "location_short": "м. Ужгород",
      "location": "Замок знаходиться у центрі міста Ужгород, на честь якого був названий. Розташований на вершині Замкової гори",
      "description_short": "Вишуканий замок у серці Ужгорода",
      "description": "Перші згадки про Ужгородський замок відносяться до IX століття. Це була твердиня на одному з горбів над поселенням білих хорватів. На той час замок мав вигляд дерев'яної фортеці, що складалася з дитинця і частоколу. Тоді ця територія була заселена слов'янами — білими хорватами. Цими землями правив князь Лаборець.\n В кінці Х - на початку ХІ ст. рівнинна частина Закарпаття була приєднана до Угорського королівства. У 1312 році замок та землі були подаровані братам Другетам. Вони володіли ними 350 років. У цей час замок зазнав реконструкції та укріплення. У 1703 році, на початку визвольної війни, замок був оточений загоном озброєних селян під проводом Івана Беци. Оборону тримали аж до наступного 1704 року.\n У 1711 році Ужгородський замок перейшов у розпорядження австрійської корони. Звідти до Відня вивезли усі матеріальні цінності. За часів правління Марії-Терезії замок був відданий Мукачівській греко-католицькій єпархії, і там була створена богословна академія. Тоді замок зазнав перебудови, зокрема було знищено лицарську залу.\n З 1947 року Ужгородський замок є краєзнавчим музеєм. На території замку відвідувачі також можуть подивитися на фундамент колишньої церкви святого Юрія, завітати до ресторану закарпатської кухні 'Ужгородський замок', а також відвідати підземелля замку (вартість вхідного квитка 20 грн), який раніше був приміщенням для тортур, а зараз там розміщений музей приладдя для катування та дегустаційна зала закарпатських вин.",
      "photos": [
        "https://tourinform.org.ua/wp-content/uploads/2017/12/big_1435.jpg",
        "../Images/Locations/uzhhorod_castle/2.jpg",
        "https://tourinform.org.ua/wp-content/uploads/2022/04/UzhZamok.jpg",
        "https://2.bp.blogspot.com/-r6pRcWKhWd0/TkIkEvS2pNI/AAAAAAAAAGg/XwoavnP8qeM/s640/MORELLI-gravure-uzhhorod-castle.jpg",
        "https://kolokray.com/pic/attraction/upload/features/55201348021413/new_2.jpg"
      ],
      "coordinates": {
        "lat": 48.62172,
        "lng": 22.30688
      },
      "author": "default",
      "status": "accepted",
      "comment": ""
    },
    {
      "id": "2",
      "name": "Замок 'Паланок'",
      "image": "https://s-vodogray.com.ua/wp-content/uploads/2021/03/Mukachevo-zamok-07-Int-1.jpg",
      "users_liked": [
        "admin"
      ],
      "ticket_price": 50,
      "ticket_prices": [
        {
          "for": "Дорослі",
          "amount": 100
        },
        {
          "for": "Студенти та пенсіонери",
          "amount": 70
        },
        {
          "for": "Діти до 14 років",
          "amount": 20
        }
      ],
      "location_short": "м. Мукачево",
      "location": "Замок знаходиться у Мукачеві, на горі вулканічного походження у західній частині міста",
      "description_short": "Неприступна фортеця Мукачева",
      "description": "Точний час заснування замку невідомий, але в документах XI століття він уже згадується. Особливого значення надав замку угорський король Стефан І Святий, укріпивши його стіни. У 1086 році Мукачівський замок успішно пережив облогу половців. У 1241 році на територію Угорського королівства напали монголи. 60-тисячна армія хана Батия вщент зруйнувала місто Мукачево, та добре укріплений замок Паланок захопити не змогла. З 1396 по 1414 року замком володів подільський князь Федір Коріятович. Він значно розбудував і зміцнив замок. Тоді ж у скелястій горі був вирубаний 85-метровий колодязь.\n Протягом XV—XVI століть замок побував у руках багатьох володарів, які його розбудовували та укріплювали. У 1633 р. Мукачівський замок придбав Трансильванський князь Юрій І Ракоці. Династія Ракоці перетворила замок у столицю і володіла ним до 1711 року. Після смерті Юрія І Ракоці У 1649 р. тут вели переговори з Юрієм II Ракоці про спільні дії проти Польщі посланці гетьмана Богдана Хмельницького. З 1685 по 1688 р. замок пережив одну з найбільших облог австрійського війська. Керувала обороною замку вдова князя Ференца І Ракоці Ілона Зріні. Після захоплення замку австрійці його реконструювали, що зробило його найсильнішою фортецею на сході Австрійської імперії.\n З 1703 по 1711 р. замок став оплотом національно-визвольної війни угорців проти австрійського гніту. Очолив війну син Ілони Зріні Ференц II Ракоці. Після поразки замок втратив своє стратегічне значення і був перетворений на в’язницю. У 1848 році, під час Угорської революції, під натиском жителів Мукачева із в'язниці замку було випущено всіх в'язнів. Згодом на честь цього в замку посадили липу, відому як Дерево Свободи, яка простояла на напівкруглому бастіоні внутрішнього двора до 1960 року. У 1896 р. в'язницю було ліквідовано на честь тисячоліття приходу угрів до Європи, але фактично вона існувала до 1903 року.\n Під час наполеонівських війн, угорська Свята Корона знаходилася під охороною в замку. У період Чехословацької республіки в замку були розташовані військові частини. Під час Другої Світової війни замок займали угорські війська. Після приєднання Закарпаття до УРСР у 1944 році  в замку містилося профтехучилище. Нині замок є історичним музеєм.",
      "photos": [
        "https://s-vodogray.com.ua/wp-content/uploads/2021/03/Mukachevo-zamok-07-Int-1.jpg",
        "https://www.ukraine-is.com/wp-content/uploads/2016/12/%D0%A4%D0%BE%D1%82%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D0%B8-%D0%A3%D0%BA%D1%80%D0%B0%D0%B8%D0%BD%D1%8B-10.png",
        "https://img.pravda.com/images/doc/e/1/e18f1a9-1680x1000palanok.jpg",
        "https://karpaty.life/uploads/zamok-palanok/mukachivskij-zamok-1.jpg",
        "https://turua.com.ua/upload/medialibrary/f8b/f8ba25f975f2a72045930a9103890924.jpg"
      ],
      "coordinates": {
        "lat": 48.43171,
        "lng": 22.68752
      },
      "author": "default",
      "status": "accepted",
      "comment": ""
    },
    {
      "id": "3a56",
      "name": "Невицький замок",
      "image": "https://glavcom.ua/img/article/5757/41_main-v1552088914.jpg",
      "users_liked": [],
      "ticket_price": 0,
      "ticket_prices": [],
      "location_short": "с. Невицьке",
      "location": "",
      "description_short": "Середньовічний замок з видом на річку Уж",
      "description": "",
      "photos": [
        "https://glavcom.ua/img/article/5757/41_main-v1552088914.jpg"
      ],
      "coordinates": {
        "lat": 48.68112,
        "lng": 22.40914
      },
      "author": "user",
      "status": "accepted",
      "comment": "Чудова локація!"
    },
    {
      "id": "b232",
      "name": "Озеро Синевир",
      "image": "https://7chudes.in.ua/wp-content/uploads/2010/09/22829155.jpg",
      "users_liked": [],
      "ticket_price": 0,
      "ticket_prices": [],
      "location_short": "Хустський р-н",
      "location": "",
      "description_short": "Мальовниче озеро в Карпатах",
      "description": "",
      "photos": [
        "https://7chudes.in.ua/wp-content/uploads/2010/09/22829155.jpg"
      ],
      "coordinates": {
        "lat": 48.61681,
        "lng": 23.68392
      },
      "author": "user",
      "status": "pending",
      "comment": ""
    }
  ]
}