{
  "users": [
    {
      "id": "admin",
      "password": "admin1234",
      "admin_access": true,
      "email": "admin@gmail.com",
      "fullname": "Адміністратор",
      "avatar": "./Images/Avatars/1.png"
    },
    {
      "id": "user",
      "password": "1234",
      "admin_access": false,
      "email": "user@gmail.com",
      "fullname": "Користувач",
      "avatar": "./Images/Avatars/5.png"
    },
    {
      "id": "vovka1602",
      "password": "1234567",
      "admin_access": false,
      "email": "vovka1602@gmail.com",
      "fullname": "Володимир",
      "avatar": "./Images/Avatars/4.png"
    }
  ],
  "locations": [
    {
      "id": "1",
      "name": "Ужгородський замок",
      "image": "https://tourinform.org.ua/wp-content/uploads/2017/12/big_1435.jpg",
      "users_liked": [
        "admin",
        "user"
      ],
      "ticket_price": 100,
      "location_short": "м. Ужгород",
      "location": "Замок знаходиться у центрі міста Ужгород, на честь якого був названий. Розташований на вершині Замкової гори",
      "description_short": "Вишуканий замок у серці Ужгорода",
      "description": "Перші згадки про Ужгородський замок відносяться до IX століття. Це була твердиня на одному з горбів над поселенням білих хорватів. На той час замок мав вигляд дерев'яної фортеці, що складалася з дитинця і частоколу. Тоді ця територія була заселена слов'янами — білими хорватами. Тут було князівство, на чолі якого стояв князь Лаборець. Літописець «Геста гунгарорум» зазначає, що Ужгородський замок і вся прилегла територія належала Лаборцю.\nКоли на князівство напали мадяри, населення стало до боротьби. Про це також пише Руський Літопис Нестора 898 року: «Пришедше от востока (угри) и устремяшеся через горьі великьія, иже прозвашася горьі Угорьскьія, и почисленною й захопила Ужгород, спаливши замок. Князь Лаборець втікав до своєї далекої фортеці — Земплина, але його наздогнали і над річкою Свіржавою повісили. Відтоді народ ту річку назвав Лаборцем — на пам'ять про князя. Але в бою за Ужгород був убитий і вождь мадярів Алмош. Мадярські кочівники поховали його у валі Земплинського городища — фортеці, яку також здобули. Могилу й багато оздоблене золотом поховання Альмоша виявили чехословацькі археологи",
      "photos": [
        "https://tourinform.org.ua/wp-content/uploads/2017/12/big_1435.jpg",
        "../Images/Locations/uzhhorod_castle/2.jpg"
      ],
      "coordinates": {
        "lat": 48.62172,
        "lng": 22.30688
      },
      "author": "default",
      "status": "accepted"
    },
    {
      "id": "2",
      "name": "Замок 'Паланок'",
      "image": "https://s-vodogray.com.ua/wp-content/uploads/2021/03/Mukachevo-zamok-07-Int-1.jpg",
      "users_liked": [
        "admin"
      ],
      "ticket_price": 40,
      "location_short": "м. Мукачево",
      "location": "Знаходиться у місті Мукачево",
      "description_short": "Неприступна фортеця Мукачева",
      "description": "Точний час заснування замку невідомий, але в документах, які позначаються XI століттям, він уже згадується. Особливого значення надав замку угорський король Стефан І Святий, укріпивши його стіни. Справу Стефана І продовжив Св. Владислав. У 1086 році Мукачівський замок взяли в облогу Половці, та вони не змогли його захопити.\n У 1241 році на територію Угорського королівства напали монголи. Одним з перших пунктів їхнього нападу на королівство було Мукачево. 60-тисячна армія хана Батия вщент зруйнувала місто, та добре укріплений замок захопити не змогла. З 1396 по 1414 року замком володів подільський князь Федір Коріятович. Він значно розбудував і зміцнив замок, перетворив його на свою резиденцію. Тоді ж у скелястій горі був вирубаний 85-метровий колодязь. \nПротягом XV—XVI століть замок побував у руках багатьох володарів, які його розбудовували та укріплювали. У цей час в оборонній системі замку було 14 веж, а у верхній частині був великий палац. У 1567 році Мукачівський замок взяв у облогу Лазарус фон Швенді. Мукачівський замок належав графу Миколаю Естергазі, який отримав його через одруження з Урсулою Дерсффі. У 1622 році за умовами Микульської угоди Мукачівський замок перейшов у володіння Габора Бетлена. Семигородський князь Юрій I Ракоці (Рагоцький) внаслідок війни, розпочатої з угорською родиною Естергазі, відвоював Мукачівський замок, який з того часу перебував у володінні родини Ракоці (Рагоцьких). У 1633 р. Мукачівській замок придбав Трансильванський князь Юрій І Ракоці з правом успадкування. Князі династії Ракоці перетворили замок у столицю свого князівства і володіли ним до 1711 року. Після смерті Юрія І Ракоці в 1648 р. його дружина Жужанна Лорантффі продовжила розбудову замку і спорудила ще дві тераси — Середню і Нижню, а також зовнішнє оборонне кільце. У 1649 р. в замку побували посланці гетьмана Богдана Хмельницького, які вели переговори з Юрієм II Ракоці про спільні дії проти Польщі. З 1685 по 1688 р. замок пережив одну з найбільших облог, яку здійснили війська Австрійського імператора. Керувала обороною замку вдова князя Ференца І Ракоці Ілона Зріні. Після захоплення замку австрійці його реконструювали, що зробило його найсильнішою фортецею на сході Австрійської імперії.",
      "photos": [
        "https://s-vodogray.com.ua/wp-content/uploads/2021/03/Mukachevo-zamok-07-Int-1.jpg"
      ],
      "coordinates": {
        "lat": 48.43171,
        "lng": 22.68752
      },
      "author": "user",
      "status": "accepted"
    },
    {
      "id": "3a56",
      "name": "Невицький замок",
      "image": "https://glavcom.ua/img/article/5757/41_main-v1552088914.jpg",
      "users_liked": [],
      "ticket_price": 0,
      "location_short": "с. Невицьке",
      "location": "",
      "description_short": "Середньовічний замок з видом на річку Уж",
      "description": "",
      "photos": [
        "https://glavcom.ua/img/article/5757/41_main-v1552088914.jpg"
      ],
      "coordinates": {
        "lat": 48.68112,
        "lng": 22.40914
      },
      "author": "user",
      "status": "pending"
    },
    {
      "id": "b232",
      "name": "Озеро Синевир",
      "image": "https://7chudes.in.ua/wp-content/uploads/2010/09/22829155.jpg",
      "users_liked": [],
      "ticket_price": 0,
      "location_short": "Хустський р-н",
      "location": "",
      "description_short": "Мальовниче озеро в Карпатах",
      "description": "",
      "photos": [
        "https://7chudes.in.ua/wp-content/uploads/2010/09/22829155.jpg"
      ],
      "coordinates": {
        "lat": 48.61681,
        "lng": 23.68392
      },
      "author": "user",
      "status": "pending"
    },
    {
      "id": "57d1",
      "name": "Замок Шенборнів",
      "image": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Zamok_grafiv_Shenborniv_01.jpg",
      "users_liked": [],
      "ticket_price": 20,
      "location_short": "с. Карпати",
      "location": "",
      "description_short": "Розкішна оселя роду графів Шенборнів",
      "description": "",
      "photos": [
        "https://upload.wikimedia.org/wikipedia/commons/2/2f/Zamok_grafiv_Shenborniv_01.jpg"
      ],
      "coordinates": {
        "lat": 48.52486,
        "lng": 22.87452
      },
      "author": "user",
      "status": "accepted"
    }
  ]
}